In [3]:
import pandas as pd
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
display(countries_df)
#создание с помощью словаря - ключ:значения

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [4]:
countries_df.index=['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
display(countries_df)
#заменили автоматические индексы на свои

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [9]:
countries_df = pd.DataFrame(
    data = [
        ['Англия', 56.29, 133396],
        ['Канада', 38.05, 9984670],
        ['США', 322.28, 9826630],
        ['Россия', 146.24, 17125191],
        ['Украина', 45.5, 603628],
        ['Беларусь', 9.5, 207600],
        ['Казахстан', 17.04, 2724902]
    ],
    columns= ['country', 'population', 'square'],
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
)
display(countries_df)
#создание с помощью вложенного списка

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [10]:
countries_df.mean(axis=0)
#среднее по строкам

C:\Users\volod\AppData\Local\Temp\ipykernel_15228\1904880919.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  countries_df.mean(axis=0)

population    9.070000e+01
square        5.800860e+06
dtype: float64

In [11]:
countries_df.mean(axis=1)
#среднее по столбцам

C:\Users\volod\AppData\Local\Temp\ipykernel_15228\2457242041.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  countries_df.mean(axis=1)

UK      66726.145
CA    4992354.025
US    4913476.140
RU    8562668.620
UA     301836.750
BY     103804.750
KZ    1362459.520
dtype: float64

In [12]:
countries_df.population
#только если имя столбца без пробела!

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

In [13]:
countries_df['population']
#обращение по индексу

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

In [14]:
type(countries_df.population)

pandas.core.series.Series

In [17]:
countries_df.loc['UK','square']

133396

In [18]:
countries_df.loc['RU', ['population', 'square']]

population      146.24
square        17125191
Name: RU, dtype: object

In [20]:
countries_df.loc[['UA', 'BY', 'KZ'],['population', 'square']]

     square  population
UA   603628       45.50
BY   207600        9.50
KZ  2724902       17.04

In [22]:
countries_df.iloc[4:8, 1:]

    population   square
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

In [23]:
a=pd.DataFrame({
    'A':[0, 1],
    'B':[1,0]
    })
display(a)

   A  B
0  0  1
1  1  0

In [25]:
b = pd.DataFrame([[0,1],[1,0],], columns= ['A', 'B'],)
display(b)

   A  B
0  0  1
1  1  0

In [29]:
df=pd.DataFrame({
        'income':[478, 512, 196],
        'expenses':[156, 130, 270]
        })
df.index=[2018, 2019, 2020]
display(df)

      income  expenses
2018     478       156
2019     512       130
2020     196       270